
#Область ПрограммныйИнтерфейс

// Partner debt обработка проведения обработка проведения.
// 
// Параметры:
//  Источник - ДокументОбъект - Источник
//  Отказ - Булево - Отказ
//  РежимПроведения - РежимПроведенияДокумента - Режим проведения
Процедура PartnerDebt_ОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Не ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не Константы.PartnerDebt_КонтрольЛимитаДолгаПартнера.Получить() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если PartnerDebt_КонтрольДолгаПартнераВызовСервера.ЛимитДолгаПартнераПревышен(Источник) Тогда
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
