
#Область ОбработчикиСобытийФормы

&После("ПриОткрытии")
&НаКлиенте
Процедура PartnerDebt_ПриОткрытии(Отказ)
	PartnerDebt_ОтбработчикиФормыПартнераКлиент.УстановитьВидимость(ЭтотОбъект);
КонецПроцедуры

&После("ПослеЗаписи")
&НаКлиенте
Процедура PartnerDebt_ПослеЗаписи(ПараметрыЗаписи)
	PartnerDebt_ОтбработчикиФормыПартнераКлиент.ОбновитьНадписьЛимитаДолга(Неопределено, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ТипУстановкиЛимитаДолгаПриИзменении(Элемент)
	PartnerDebt_ОтбработчикиФормыПартнераКлиент.УстановитьВидимость(ЭтотОбъект);
	PartnerDebt_ОтбработчикиФормыПартнераКлиент.ОбновитьНадписьЛимитаДолга(Неопределено, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_PartnerDebt_УстановитьЛимитДолга(Команда)
	
	PartnerDebt_ОтбработчикиФормыПартнераКлиент.УстановитьЛимитДолга(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_PartnerDebt_ПосмотретьИсториюИзмененийРучногоЛимита(Команда)
	
	PartnerDebt_ОтбработчикиФормыПартнераКлиент.ОткрытьФормуСпискаРучныхЛимитовСОтборомПоПартнеру(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти
